**Content:**
- 对某个string “”的methods
    - string.lower()
    - string.upper()
    - len(string)
    - string.title() 每一个单词首字母大写
    - string.replace("j","l")  替换局部，如j 替成 l
- 对series每一项string的处理，返回结果列
    - Series.str.title()
    - Series.str.len() 
    - Series.str.replace(a,b)
        - chicago["Employee Annual Salary"].str.replace("$","").astype("float")
    - Series.str.contains("a") 返回是含有a
    - Series.str.startswith("r") 返回是否以r开头的TF列
    - Series.str.endswith("ist") 
    - 与截取一起使用：检索出来某列 含有~/开头/结尾的行
        - mask = chicago["Position Title"].str.lower().str.endswith("ist")
        - chicago[mask]
- 移除空格
    - string.strip()移除开头结尾的空格，但不删除中间的空格
    - string.rstrip()移除最right的空格
    - string.lstrip()移除最left的空格
- 分割成多个部分储存在string list 中
    - string.split(" ")
- 取分割后的第几部分
    - string.split(",").get(n)
    - chicago["Name"].str.split(",").str.get(0)
- 配合计数每个名字在series中出现字数
    - chicago["Name"].str.split(",").str.get(0).value_counts()
    - 注意，一大堆....的时候，由左的结果向右处理
- series.str.split(" ", expand = True， n)
    - expand: 将一列string series拆成多列/存在dataframe中
    - n: 从左至右，最多分几次
        - chicago[["First Name","Last Name"]] = chicago["Name"].str.split(",", expand=True)

# Import Data

In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv("chicago.csv")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [3]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

In [4]:
chicago["Department"].nunique()

35

In [5]:
chicago["Department"].count()

32062

# Common attributes/methods

In [6]:
string="hi, jessy"

In [7]:
string.lower()

'hi, jessy'

In [8]:
string.upper()

'HI, JESSY'

In [9]:
string.title() # upper case for first letter of each word

'Hi, Jessy'

In [10]:
len(string)

9

In [12]:
chicago["Name"].title() #not work because conflict with some other functions for series

AttributeError: 'Series' object has no attribute 'title'

In [13]:
chicago["Name"].str.title() #work! use str to emphasize it's a string method

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [14]:
chicago["Position Title"] = chicago["Position Title"].str.title()

In [15]:
len(chicago["Position Title"]) #count lines, not number of letter in each line

32063

In [16]:
chicago["Position Title"].str.len() #string function on each line of series

0        16.0
1        14.0
2        14.0
3        24.0
4        17.0
         ...
32058    14.0
32059    14.0
32060    14.0
32061    23.0
32062     NaN
Name: Position Title, Length: 32063, dtype: float64

In [17]:
string.replace("j","l") #replace j with l

'hi, lessy'

In [18]:
chicago["Employee Annual Salary"].str.replace("$","").astype("float")

0         90744.0
1         84450.0
2         84450.0
3         89880.0
4        106836.0
           ...
32058     87384.0
32059     84450.0
32060     87384.0
32061    113664.0
32062         NaN
Name: Employee Annual Salary, Length: 32063, dtype: float64

In [19]:
chicago=chicago.dropna(how="all")

- series.str.contains("a")

In [20]:
mask = chicago["Position Title"].str.lower().str.contains("water")
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",Water Chemist Ii,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",District Superintendent Of Water Distribution,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",Managing Engineer - Water Management,WATER MGMNT,$111192.00
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MGMNT,$89676.00
30544,"WEST, THOMAS R",Gen Supt Of Water Management,WATER MGMNT,$115704.00
30991,"WILLIAMS, MATTHEW",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00
31405,"WOODRIDGE, ROBERT L",Foreman Of Water Pipe Construction,WATER MGMNT,$102440.00

- series.str.startswith("water")

In [21]:
mask = chicago["Position Title"].str.lower().str.startswith("water")
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MGMNT,$90744.00
671,"ANDER, PERRY A",Water Chemist Ii,WATER MGMNT,$82044.00
1054,"ASHLEY, KARMA T",Water Chemist Ii,WATER MGMNT,$82044.00
1079,"ATKINS, JOANNA M",Water Chemist Ii,WATER MGMNT,$82044.00
1181,"AZEEM, MOHAMMED A",Water Chemist Ii,WATER MGMNT,$53172.00
...,...,...,...,...
28574,"THREATT, DENISE R",Water Quality Inspector,WATER MGMNT,$62004.00
28602,"TIGNOR, DARRYL B",Water Rate Taker,WATER MGMNT,$78948.00
28955,"TRAVIS COOK, LESLIE R",Water Rate Taker,WATER MGMNT,$78948.00
29584,"VELAZQUEZ, JOHN",Water Rate Taker,WATER MGMNT,$78948.00
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MGMNT,$89676.00

series.str.endswith("a")

In [22]:
mask = chicago["Position Title"].str.lower().str.endswith("ist")
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",Psychiatrist,HEALTH,$99840.00
308,"ALARCON, LUIS J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",Senior Telecommunications Specialist,DoIT,$89880.00
472,"ALLEN, ROBERT",Machinist,WATER MGMNT,$94328.00
705,"ANDERSON, EDWARD M",Sr Procurement Specialist,PROCUREMENT,$91476.00
...,...,...,...,...
31667,"YODER, TERESA G",Archival Specialist,PUBLIC LIBRARY,$74304.00
31688,"YOUNGBLOOM, LAURENCE G",Crimes Surveillance Specialist,OEMC,$19676.80
31717,"YOUNG, KIMBERLY M",Sr Procurement Specialist,PROCUREMENT,$68556.00
31837,"ZAPATA, HUGO",Sr Procurement Specialist,PROCUREMENT,$87324.00
31918,"ZEMKE, RICHARD P",Machinist,AVIATION,$94328.00

- 移除空格
    - string.strip()移除开头结尾的空格，但不删除中间的空格
    - string.rstrip()移除最right的空格
    - string.lstrip()移除最left的空格

In [23]:
"    a da    ".lstrip()

'a da    '

In [24]:
"    a da    ".rstrip()

'    a da'

In [25]:
"    a da    ".strip()

'a da'

In [26]:
chicago["Position Title"].str.strip()

0                      Water Rate Taker
1                        Police Officer
2                        Police Officer
3              Chief Contract Expediter
4                     Civil Engineer Iv
                      ...
32057    Frm Of Machinists - Automotive
32058                    Police Officer
32059                    Police Officer
32060                    Police Officer
32061           Chief Data Base Analyst
Name: Position Title, Length: 32062, dtype: object

In [27]:
chicago.set_index("Name",inplace=True)

- index若被设置成string, 同样可以处理
- column同理

In [28]:
chicago.index = chicago.index.str.strip().str.title()

In [29]:
chicago.columns

Index(['Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [30]:
chicago.columns.str.upper()

Index(['POSITION TITLE', 'DEPARTMENT', 'EMPLOYEE ANNUAL SALARY'], dtype='object')

In [31]:
chicago.columns=chicago.columns.str.upper()
chicago.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    Water Rate Taker  WATER MGMNT              $90744.00
Aaron,  Jeffery M    Police Officer       POLICE              $84450.00
Aaron,  Karina       Police Officer       POLICE              $84450.00

- 分割成多个部分储存在string list 中
    - string.split(" ")
- 取分割后的第几部分
    - string.split(",").get(n)
    - chicago["Name"].str.split(",").str.get(0)
- 配合计数每个名字在series中出现字数
    - chicago["Name"].str.split(",").str.get(0).value_counts()
    - 注意，一大堆....的时候，由左的结果向右处理

In [32]:
"Hi,my,lady".split(",")

['Hi', 'my', 'lady']

In [33]:
chicago.reset_index(inplace=True)

In [34]:
chicago["Name"].head(3)

0      Aaron,  Elvia J
1    Aaron,  Jeffery M
2       Aaron,  Karina
Name: Name, dtype: object

In [35]:
chicago["Name"].str.split(",")

0            [Aaron,   Elvia J]
1          [Aaron,   Jeffery M]
2             [Aaron,   Karina]
3        [Aaron,   Kimberlei R]
4        [Abad Jr,   Vicente M]
                  ...
32057    [Zygadlo,   Michael J]
32058     [Zygowicz,   Peter J]
32059      [Zymantas,   Mark E]
32060    [Zyrkowski,   Carlo E]
32061    [Zyskowski,   Dariusz]
Name: Name, Length: 32062, dtype: object

In [36]:
chicago["Name"].str.split(",").str.get(0) #get which part of the string list

0            Aaron
1            Aaron
2            Aaron
3            Aaron
4          Abad Jr
           ...
32057      Zygadlo
32058     Zygowicz
32059     Zymantas
32060    Zyrkowski
32061    Zyskowski
Name: Name, Length: 32062, dtype: object

In [37]:
chicago["Name"].str.split(",").str.get(0).value_counts()

Williams       293
Johnson        244
Smith          241
Brown          185
Jones          183
              ...
Montanaro        1
Schoenstadt      1
Marzullo Jr      1
Mustin           1
Zurita           1
Name: Name, Length: 13829, dtype: int64

- get first name

In [38]:
chicago["Name"].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0)

0            Elvia
1          Jeffery
2           Karina
3        Kimberlei
4          Vicente
           ...
32057      Michael
32058        Peter
32059         Mark
32060        Carlo
32061      Dariusz
Name: Name, Length: 32062, dtype: object

- series.str.split(" ", expand = True， n)
    - expand: 将一列string series拆成多列/存在dataframe中
    - n: 从左至右，最多分几次
        - chicago[["First Name","Last Name"]] = chicago["Name"].str.split(",", expand=True)

In [39]:
chicago[["First Name","Last Name"]] = chicago["Name"].str.split(",", expand=True)

In [40]:
chicago[["First Name","Last Name"]].head(3)

  First Name    Last Name
0      Aaron      Elvia J
1      Aaron    Jeffery M
2      Aaron       Karina

In [41]:
chicago["POSITION TITLE"].str.split(" ",expand=True,n=1)

            0                           1
0       Water                  Rate Taker
1      Police                     Officer
2      Police                     Officer
3       Chief          Contract Expediter
4       Civil                 Engineer Iv
...       ...                         ...
32057     Frm  Of Machinists - Automotive
32058  Police                     Officer
32059  Police                     Officer
32060  Police                     Officer
32061   Chief           Data Base Analyst

[32062 rows x 2 columns]